* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAM:  CALCDSCT
* SYSTEM:   SIFAP - PAYMENT INSPECTION AND ADMINISTRATION SYSTEM
* AUTHOR:   ROBERTO MENDES JUNIOR
* DATE:     25/08/1999
* CHANGED:  12/04/2007 - MARCIA HELENA - ADDED COURT-ORDERED DISCOUNT
* CHANGED:  30/09/2015 - ANDERSON LIMA - NEW RATES
* CHANGED:  14/06/2016 - SUPDE TEAM - TICKET 7210 DDM STANDARD
* PURPOSE:  CALCULATE BENEFIT DISCOUNTS AND DEDUCTIONS
*           PROCESS MANDATORY DISCOUNT - FILES 160/150
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAYMENT-V VIEW OF PAYMENT
    2 NUM-PAYMENT         (N15)
    2 NUM-CPF             (A11)
    2 AMT-GROSS           (P9.2)
    2 AMT-DISC-TOTAL      (P7.2)
    2 YEAR-MONTH-REF      (N6)
    2 GRP-DISC            (1:8)
      3 TYPE-DISC         (A3)    /* C=CONTRIB I=TAX J=COURT-ORDERED
                                    S=UNION P=ALIMONY A=ADMIN */
      3 AMT-DISC          (P7.2)
      3 PCT-DISC          (P3.2)
      3 DT-START-DISC     (N8)
      3 DT-END-DISC       (N8)
      3 NUM-CASE          (A20)
*
  1 BENEFICIARY-V VIEW OF BENEFIC
    2 NUM-CPF             (A11)
    2 FULL-NAME           (A60)
    2 STAT-BENEFICIARY    (A1)
    2 UF                  (A2)
*
  1 #CPF                  (N11)
  1 #CPF-STR              (A11)
  1 #NUM-PAYMENT          (N15)
  1 #AMT-GROSS            (P9.2)
  1 #AMT-TOTAL-DISC       (P9.2)
  1 #AMT-DISC-ITEM        (P9.2)
  1 #AMT-MAX-DISC         (P9.2)
  1 #AMT-TEMP             (N11)
  1 #PCT-DISC             (P3.2)
  1 #TYPE-DISC            (A1)
  1 #NUM-DISC             (N2)
  1 #INDEX                (N2)
  1 #DT-TODAY             (N8)
  1 #FOUND                (L)
  1 #PERIOD               (N6)
  1 #MSG                  (A60)
  1 #K                    (N2)
*
* CONTRIBUTION RATE TABLE
  1 #BAND-CONTRIB         (P9.2/1:4)
  1 #RATE-CONTRIB         (N3.2/1:4)
END-DEFINE
*
MOVE *DATN TO #DT-TODAY
*
* LOAD SOCIAL CONTRIBUTION TABLE
MOVE  500.00 TO #BAND-CONTRIB(1)
MOVE  0.03   TO #RATE-CONTRIB(1)
MOVE 1000.00 TO #BAND-CONTRIB(2)
MOVE  0.05   TO #RATE-CONTRIB(2)
MOVE 2000.00 TO #BAND-CONTRIB(3)
MOVE  0.07   TO #RATE-CONTRIB(3)
MOVE 9999.99 TO #BAND-CONTRIB(4)
MOVE  0.09   TO #RATE-CONTRIB(4)
*
INPUT 'SIFAP - DISCOUNT CALCULATION' /
      '============================' /
      'BENEFICIARY CPF.:' #CPF /
      'PAYMENT NUMBER..:' #NUM-PAYMENT
*
* FIND PAYMENT - FILE 160
MOVE EDITED #CPF (EM=99999999999) TO #CPF-STR
MOVE FALSE TO #FOUND
FIND PAYMENT-V WITH NUM-PAYMENT = #NUM-PAYMENT
  IF PAYMENT-V.NUM-CPF = #CPF-STR
    MOVE TRUE TO #FOUND
    MOVE PAYMENT-V.AMT-GROSS TO #AMT-GROSS
    MOVE PAYMENT-V.YEAR-MONTH-REF TO #PERIOD
  END-IF
END-FIND
*
IF NOT #FOUND
  WRITE 'PAYMENT NOT FOUND'
  ESCAPE ROUTINE
END-IF
*
* FIND BENEFICIARY - FILE 150
FIND BENEFICIARY-V WITH NUM-CPF = #CPF-STR
  IGNORE
END-FIND
IF *NUMBER(BENEFICIARY-V) = 0
  WRITE 'BENEFICIARY NOT FOUND'
  ESCAPE ROUTINE
END-IF
*
MOVE 0 TO #AMT-TOTAL-DISC
*
* CALCULATE SOCIAL CONTRIBUTION DISCOUNT (MANDATORY)
PERFORM CALC-CONTRIB-SOCIAL
*
* CALCULATE MAXIMUM DISCOUNT CAP - 30% OF GROSS
COMPUTE #AMT-MAX-DISC = #AMT-GROSS * 0.30
* TRUNCATE
COMPUTE #AMT-TEMP = #AMT-MAX-DISC * 100
COMPUTE #AMT-MAX-DISC = #AMT-TEMP / 100
*
* PROCESS DISCOUNTS REGISTERED IN THE PE GROUP
FIND PAYMENT-V WITH NUM-PAYMENT = #NUM-PAYMENT
  FOR #INDEX = 1 TO C*GRP-DISC
*
* CHECK DISCOUNT EFFECTIVE PERIOD
    IF PAYMENT-V.DT-END-DISC(#INDEX) NE 0
        AND PAYMENT-V.DT-END-DISC(#INDEX) < #DT-TODAY
      ESCAPE TOP
    END-IF
    IF PAYMENT-V.DT-START-DISC(#INDEX) > #DT-TODAY
      ESCAPE TOP
    END-IF
*
    MOVE PAYMENT-V.TYPE-DISC(#INDEX) TO #TYPE-DISC
*
    DECIDE ON FIRST VALUE OF #TYPE-DISC
      VALUE 'J'
* COURT-ORDERED DISCOUNT - FIXED AMOUNT OR PERCENTAGE
        IF PAYMENT-V.AMT-DISC(#INDEX) > 0
          MOVE PAYMENT-V.AMT-DISC(#INDEX) TO #AMT-DISC-ITEM
        ELSE
          COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
              (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        END-IF
* COURT-ORDERED DISCOUNT HAS NO CAP
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'P'
* ALIMONY
        IF PAYMENT-V.AMT-DISC(#INDEX) > 0
          MOVE PAYMENT-V.AMT-DISC(#INDEX) TO #AMT-DISC-ITEM
        ELSE
          COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
              (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        END-IF
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'I'
* WITHHOLDING TAX
        COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
            (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'S'
* UNION DUES
        COMPUTE #AMT-DISC-ITEM = #AMT-GROSS * 0.01
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'A'
* ADMINISTRATIVE DISCOUNT
        IF PAYMENT-V.AMT-DISC(#INDEX) > 0
          MOVE PAYMENT-V.AMT-DISC(#INDEX) TO #AMT-DISC-ITEM
        ELSE
          COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
              (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        END-IF
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      NONE
        IGNORE
    END-DECIDE
*
* APPLY 30% CAP - EXCEPT COURT-ORDERED
    IF #TYPE-DISC NE 'J'
      IF #AMT-TOTAL-DISC > #AMT-MAX-DISC
        MOVE #AMT-MAX-DISC TO #AMT-TOTAL-DISC
      END-IF
    END-IF
*
  END-FOR
END-FIND
*
* TRUNCATE TOTAL DISCOUNT
COMPUTE #AMT-TEMP = #AMT-TOTAL-DISC * 100
COMPUTE #AMT-TOTAL-DISC = #AMT-TEMP / 100
*
* UPDATE PAYMENT
FIND PAYMENT-V WITH NUM-PAYMENT = #NUM-PAYMENT
  MOVE #AMT-TOTAL-DISC TO PAYMENT-V.AMT-DISC-TOTAL
  UPDATE PAYMENT-V
  END TRANSACTION
END-FIND
*
WRITE 'DISCOUNTS CALCULATED' /
      '====================' /
      'GROSS AMOUNT..:' #AMT-GROSS /
      'DISCOUNT......:' #AMT-TOTAL-DISC /
      '30% CAP.......:' #AMT-MAX-DISC
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE CALC-CONTRIB-SOCIAL
  FOR #K = 1 TO 4
    IF #AMT-GROSS <= #BAND-CONTRIB(#K)
      COMPUTE #AMT-DISC-ITEM = #AMT-GROSS * #RATE-CONTRIB(#K)
      ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* NATURAL ERROR HANDLING - TICKET 7210
ON ERROR
  WRITE 'NATURAL ERROR' *ERROR-NR
        'LINE'          *ERROR-LINE
        'PGM'          *PROGRAM
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
